export default [
    {
      id: 1,
      title: "判断三角形问题",
      description: "这个问题涉及如何判断一个三角形的类型。在数学中，一个三角形可以根据其边长或角度分类。此问题要求解决如何确定给定三条边长的三角形类型。根据三角形的性质，可以将其分为等边三角形、等腰三角形、直角三角形、锐角三角形或钝角三角形。解决这个问题的方法可能涉及计算三角形的边长、使用三角函数来计算角度，或者使用一系列的条件语句来根据给定的边长确定三角形的类型。"
    },
    {
      id: 2,
      title: "万年历问题",
      description: "这个问题涉及如何计算和显示一个特定年份的万年历。万年历是一种显示特定年份所有月份、日期和星期几的日历。解决这个问题的方法可能涉及确定给定年份的闰年规则，计算每个月份的天数，确定每个月份的起始日和星期几，然后将这些信息整合成一个完整的日历表格。在现代计算机中，可以使用编程语言和日期/时间库来实现万年历功能。解决这个问题的方法可以包括日期计算、条件语句、循环和表格布局等技术"
    },
  ];